MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K42/mcu.h
extern volatile DMA1BUFbits_t DMA1BUFbits __at(0x3BE9);
// bitfield macros
#define _DMA1BUF_BUF_POSN                                   0x0
#define _DMA1BUF_BUF_POSITION                               0x0
#define _DMA1BUF_BUF_SIZE                                   0x8
#define _DMA1BUF_BUF_LENGTH                                 0x8
#define _DMA1BUF_BUF_MASK                                   0xFF
#define _DMA1BUF_BUF0_POSN                                  0x0
#define _DMA1BUF_BUF0_POSITION                              0x0
#define _DMA1BUF_BUF0_SIZE                                  0x1
#define _DMA1BUF_BUF0_LENGTH                                0x1
#define _DMA1BUF_BUF0_MASK                                  0x1
#define _DMA1BUF_BUF1_POSN                                  0x1
#define _DMA1BUF_BUF1_POSITION                              0x1
#define _DMA1BUF_BUF1_SIZE                                  0x1
#define _DMA1BUF_BUF1_LENGTH                                0x1
#define _DMA1BUF_BUF1_MASK                                  0x2
#define _DMA1BUF_BUF2_POSN                                  0x2
#define _DMA1BUF_BUF2_POSITION                              0x2
#define _DMA1BUF_BUF2_SIZE                                  0x1
#define _DMA1BUF_BUF2_LENGTH                                0x1
#define _DMA1BUF_BUF2_MASK                                  0x4
#define _DMA1BUF_BUF3_POSN                                  0x3
#define _DMA1BUF_BUF3_POSITION                              0x3
#define _DMA1BUF_BUF3_SIZE                                  0x1
#define _DMA1BUF_BUF3_LENGTH                                0x1
#define _DMA1BUF_BUF3_MASK                                  0x8
#define _DMA1BUF_BUF4_POSN                                  0x4
#define _DMA1BUF_BUF4_POSITION                              0x4
#define _DMA1BUF_BUF4_SIZE                                  0x1
#define _DMA1BUF_BUF4_LENGTH                                0x1
#define _DMA1BUF_BUF4_MASK                                  0x10
#define _DMA1BUF_BUF5_POSN                                  0x5
#define _DMA1BUF_BUF5_POSITION                              0x5
#define _DMA1BUF_BUF5_SIZE                                  0x1
#define _DMA1BUF_BUF5_LENGTH                                0x1
#define _DMA1BUF_BUF5_MASK                                  0x20
#define _DMA1BUF_BUF6_POSN                                  0x6
#define _DMA1BUF_BUF6_POSITION                              0x6
#define _DMA1BUF_BUF6_SIZE                                  0x1
#define _DMA1BUF_BUF6_LENGTH                                0x1
#define _DMA1BUF_BUF6_MASK                                  0x40
#define _DMA1BUF_BUF7_POSN                                  0x7
#define _DMA1BUF_BUF7_POSITION                              0x7
#define _DMA1BUF_BUF7_SIZE                                  0x1
#define _DMA1BUF_BUF7_LENGTH                                0x1
#define _DMA1BUF_BUF7_MASK                                  0x80
#define _DMA1BUF_DMA1BUF_POSN                               0x0
#define _DMA1BUF_DMA1BUF_POSITION                           0x0
#define _DMA1BUF_DMA1BUF_SIZE                               0x8
#define _DMA1BUF_DMA1BUF_LENGTH                             0x8
#define _DMA1BUF_DMA1BUF_MASK                               0xFF
#define _DMA1BUF_DMA1BUF0_POSN                              0x0
#define _DMA1BUF_DMA1BUF0_POSITION                          0x0
#define _DMA1BUF_DMA1BUF0_SIZE                              0x1
#define _DMA1BUF_DMA1BUF0_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF0_MASK                              0x1
#define _DMA1BUF_DMA1BUF1_POSN                              0x1
#define _DMA1BUF_DMA1BUF1_POSITION                          0x1
#define _DMA1BUF_DMA1BUF1_SIZE                              0x1
#define _DMA1BUF_DMA1BUF1_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF1_MASK                              0x2
#define _DMA1BUF_DMA1BUF2_POSN                              0x2
#define _DMA1BUF_DMA1BUF2_POSITION                          0x2
#define _DMA1BUF_DMA1BUF2_SIZE                              0x1
#define _DMA1BUF_DMA1BUF2_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF2_MASK                              0x4
#define _DMA1BUF_DMA1BUF3_POSN                              0x3
#define _DMA1BUF_DMA1BUF3_POSITION                          0x3
#define _DMA1BUF_DMA1BUF3_SIZE                              0x1
#define _DMA1BUF_DMA1BUF3_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF3_MASK                              0x8
#define _DMA1BUF_DMA1BUF4_POSN                              0x4
#define _DMA1BUF_DMA1BUF4_POSITION                          0x4
#define _DMA1BUF_DMA1BUF4_SIZE                              0x1
#define _DMA1BUF_DMA1BUF4_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF4_MASK                              0x10
#define _DMA1BUF_DMA1BUF5_POSN                              0x5
#define _DMA1BUF_DMA1BUF5_POSITION                          0x5
#define _DMA1BUF_DMA1BUF5_SIZE                              0x1
#define _DMA1BUF_DMA1BUF5_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF5_MASK                              0x20
#define _DMA1BUF_DMA1BUF6_POSN                              0x6
#define _DMA1BUF_DMA1BUF6_POSITION                          0x6
#define _DMA1BUF_DMA1BUF6_SIZE                              0x1
#define _DMA1BUF_DMA1BUF6_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF6_MASK                              0x40
#define _DMA1BUF_DMA1BUF7_POSN                              0x7
#define _DMA1BUF_DMA1BUF7_POSITION                          0x7
#define _DMA1BUF_DMA1BUF7_SIZE                              0x1
#define _DMA1BUF_DMA1BUF7_LENGTH                            0x1
#define _DMA1BUF_DMA1BUF7_MASK                              0x80

// Register: DMA1DCNT
#define DMA1DCNT DMA1DCNT
extern volatile unsigned short          DMA1DCNT            __at(0x3BEA);
#ifndef _LIB_BUILD
asm("DMA1DCNT equ 03BEAh");
#endif

// Register: DMA1DCNTL
#define DMA1DCNTL DMA1DCNTL
extern volatile unsigned char           DMA1DCNTL           __at(0x3BEA);
#ifndef _LIB_BUILD
asm("DMA1DCNTL equ 03BEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT0                  :1;
        unsigned DCNT1                  :1;
        unsigned DCNT2                  :1;
        unsigned DCNT3                  :1;
        unsigned DCNT4                  :1;
        unsigned DCNT5                  :1;
        unsigned DCNT6                  :1;
        unsigned DCNT7                  :1;
    };
    struct {
        unsigned DMA1DCNT               :8;
    };
    struct {
        unsigned DMA1DCNT0              :1;
        unsigned DMA1DCNT1              :1;
        unsigned DMA1DCNT2              :1;
        unsigned DMA1DCNT3              :1;
        unsigned DMA1DCNT4              :1;
        unsigned DMA1DCNT5              :1;
        unsigned DMA1DCNT6              :1;
        unsigned DMA1DCNT7              :1;
    };
} DMA1DCNTLbits_t;
extern volatile DMA1DCNTLbits_t DMA1DCNTLbits __at(0x3BEA);
// bitfield macros
#define _DMA1DCNTL_DCNT_POSN                                0x0
#define _DMA1DCNTL_DCNT_POSITION                            0x0
#define _DMA1DCNTL_DCNT_SIZE                                0x8
#define _DMA1DCNTL_DCNT_LENGTH                              0x8
#define _DMA1DCNTL_DCNT_MASK                                0xFF
#define _DMA1DCNTL_DCNT0_POSN                               0x0
#define _DMA1DCNTL_DCNT0_POSITION                           0x0
#define _DMA1DCNTL_DCNT0_SIZE                               0x1
#define _DMA1DCNTL_DCNT0_LENGTH                             0x1
#define _DMA1DCNTL_DCNT0_MASK                               0x1
#define _DMA1DCNTL_DCNT1_POSN                               0x1
#define _DMA1DCNTL_DCNT1_POSITION                           0x1
#define _DMA1DCNTL_DCNT1_SIZE                               0x1
#define _DMA1DCNTL_DCNT1_LENGTH                             0x1
#define _DMA1DCNTL_DCNT1_MASK                               0x2
#define _DMA1DCNTL_DCNT2_POSN                               0x2
#define _DMA1DCNTL_DCNT2_POSITION                           0x2
#define _DMA1DCNTL_DCNT2_SIZE                               0x1
#define _DMA1DCNTL_DCNT2_LENGTH                             0x1
#define _DMA1DCNTL_DCNT2_MASK                               0x4
#define _DMA1DCNTL_DCNT3_POSN                               0x3
#define _DMA1DCNTL_DCNT3_POSITION                           0x3
#define _DMA1DCNTL_DCNT3_SIZE                               0x1
#define _DMA1DCNTL_DCNT3_LENGTH                             0x1
#define _DMA1DCNTL_DCNT3_MASK                               0x8
#define _DMA1DCNTL_DCNT4_POSN                               0x4
#define _DMA1DCNTL_DCNT4_POSITION                           0x4
#define _DMA1DCNTL_DCNT4_SIZE                               0x1
#define _DMA1DCNTL_DCNT4_LENGTH                             0x1
#define _DMA1DCNTL_DCNT4_MASK                               0x10
#define _DMA1DCNTL_DCNT5_POSN                               0x5
#define _DMA1DCNTL_DCNT5_POSITION                           0x5
#define _DMA1DCNTL_DCNT5_SIZE                               0x1
#define _DMA1DCNTL_DCNT5_LENGTH                             0x1
#define _DMA1DCNTL_DCNT5_MASK                               0x20
#define _DMA1DCNTL_DCNT6_POSN                               0x6
#define _DMA1DCNTL_DCNT6_POSITION                           0x6
#define _DMA1DCNTL_DCNT6_SIZE                               0x1
#define _DMA1DCNTL_DCNT6_LENGTH                             0x1
#define _DMA1DCNTL_DCNT6_MASK                               0x40
#define _DMA1DCNTL_DCNT7_POSN                               0x7
#define _DMA1DCNTL_DCNT7_POSITION                           0x7
#define _DMA1DCNTL_DCNT7_SIZE                               0x1
#define _DMA1DCNTL_DCNT7_LENGTH                             0x1
#define _DMA1DCNTL_DCNT7_MASK                               0x80
#define _DMA1DCNTL_DMA1DCNT_POSN                            0x0
#define _DMA1DCNTL_DMA1DCNT_POSITION                        0x0
#define _DMA1DCNTL_DMA1DCNT_SIZE                            0x8
#define _DMA1DCNTL_DMA1DCNT_LENGTH                          0x8
#define _DMA1DCNTL_DMA1DCNT_MASK                            0xFF
#define _DMA1DCNTL_DMA1DCNT0_POSN                           0x0
#define _DMA1DCNTL_DMA1DCNT0_POSITION                       0x0
#define _DMA1DCNTL_DMA1DCNT0_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT0_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT0_MASK                           0x1
#define _DMA1DCNTL_DMA1DCNT1_POSN                           0x1
#define _DMA1DCNTL_DMA1DCNT1_POSITION                       0x1
#define _DMA1DCNTL_DMA1DCNT1_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT1_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT1_MASK                           0x2
#define _DMA1DCNTL_DMA1DCNT2_POSN                           0x2
#define _DMA1DCNTL_DMA1DCNT2_POSITION                       0x2
#define _DMA1DCNTL_DMA1DCNT2_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT2_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT2_MASK                           0x4
#define _DMA1DCNTL_DMA1DCNT3_POSN                           0x3
#define _DMA1DCNTL_DMA1DCNT3_POSITION                       0x3
#define _DMA1DCNTL_DMA1DCNT3_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT3_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT3_MASK                           0x8
#define _DMA1DCNTL_DMA1DCNT4_POSN                           0x4
#define _DMA1DCNTL_DMA1DCNT4_POSITION                       0x4
#define _DMA1DCNTL_DMA1DCNT4_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT4_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT4_MASK                           0x10
#define _DMA1DCNTL_DMA1DCNT5_POSN                           0x5
#define _DMA1DCNTL_DMA1DCNT5_POSITION                       0x5
#define _DMA1DCNTL_DMA1DCNT5_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT5_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT5_MASK                           0x20
#define _DMA1DCNTL_DMA1DCNT6_POSN                           0x6
#define _DMA1DCNTL_DMA1DCNT6_POSITION                       0x6
#define _DMA1DCNTL_DMA1DCNT6_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT6_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT6_MASK                           0x40
#define _DMA1DCNTL_DMA1DCNT7_POSN                           0x7
#define _DMA1DCNTL_DMA1DCNT7_POSITION                       0x7
#define _DMA1DCNTL_DMA1DCNT7_SIZE                           0x1
#define _DMA1DCNTL_DMA1DCNT7_LENGTH                         0x1
#define _DMA1DCNTL_DMA1DCNT7_MASK                           0x80

// Register: DMA1DCNTH
#define DMA1DCNTH DMA1DCNTH
extern volatile unsigned char           DMA1DCNTH           __at(0x3BEB);
#ifndef _LIB_BUILD
asm("DMA1DCNTH equ 03BEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :4;
    };
    struct {
        unsigned DCNT8                  :1;
        unsigned DCNT9                  :1;
        unsigned DCNT10                 :1;
        unsigned DCNT11                 :1;
    };
    struct {
        unsigned DMA1SCNT               :4;
    };
    struct {
        unsigned DMA1DCNT8              :1;
        unsigned DMA1DCNT9              :1;
        unsigned DMA1DCNT10             :1;
        unsigned DMA1DCNT11             :1;
    };
} DMA1DCNTHbits_t;
