MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K42/mcu.h
#define                                 CCDNB2_bit          _BIT_ACCESS(CCDNB,2)
// CCDNB<CCDNB3>
extern volatile __bit                   CCDNB3              __at(0x1D2CB);	// @ (0x3A59 * 8 + 3)
#define                                 CCDNB3_bit          _BIT_ACCESS(CCDNB,3)
// CCDNB<CCDNB4>
extern volatile __bit                   CCDNB4              __at(0x1D2CC);	// @ (0x3A59 * 8 + 4)
#define                                 CCDNB4_bit          _BIT_ACCESS(CCDNB,4)
// CCDNB<CCDNB5>
extern volatile __bit                   CCDNB5              __at(0x1D2CD);	// @ (0x3A59 * 8 + 5)
#define                                 CCDNB5_bit          _BIT_ACCESS(CCDNB,5)
// CCDNB<CCDNB6>
extern volatile __bit                   CCDNB6              __at(0x1D2CE);	// @ (0x3A59 * 8 + 6)
#define                                 CCDNB6_bit          _BIT_ACCESS(CCDNB,6)
// CCDNB<CCDNB7>
extern volatile __bit                   CCDNB7              __at(0x1D2CF);	// @ (0x3A59 * 8 + 7)
#define                                 CCDNB7_bit          _BIT_ACCESS(CCDNB,7)
// CCDNC<CCDNC0>
extern volatile __bit                   CCDNC0              __at(0x1D348);	// @ (0x3A69 * 8 + 0)
#define                                 CCDNC0_bit          _BIT_ACCESS(CCDNC,0)
// CCDNC<CCDNC1>
extern volatile __bit                   CCDNC1              __at(0x1D349);	// @ (0x3A69 * 8 + 1)
#define                                 CCDNC1_bit          _BIT_ACCESS(CCDNC,1)
// CCDNC<CCDNC2>
extern volatile __bit                   CCDNC2              __at(0x1D34A);	// @ (0x3A69 * 8 + 2)
#define                                 CCDNC2_bit          _BIT_ACCESS(CCDNC,2)
// CCDNC<CCDNC3>
extern volatile __bit                   CCDNC3              __at(0x1D34B);	// @ (0x3A69 * 8 + 3)
#define                                 CCDNC3_bit          _BIT_ACCESS(CCDNC,3)
// CCDNC<CCDNC4>
extern volatile __bit                   CCDNC4              __at(0x1D34C);	// @ (0x3A69 * 8 + 4)
#define                                 CCDNC4_bit          _BIT_ACCESS(CCDNC,4)
// CCDNC<CCDNC5>
extern volatile __bit                   CCDNC5              __at(0x1D34D);	// @ (0x3A69 * 8 + 5)
#define                                 CCDNC5_bit          _BIT_ACCESS(CCDNC,5)
// CCDNC<CCDNC6>
extern volatile __bit                   CCDNC6              __at(0x1D34E);	// @ (0x3A69 * 8 + 6)
#define                                 CCDNC6_bit          _BIT_ACCESS(CCDNC,6)
// CCDNC<CCDNC7>
extern volatile __bit                   CCDNC7              __at(0x1D34F);	// @ (0x3A69 * 8 + 7)
#define                                 CCDNC7_bit          _BIT_ACCESS(CCDNC,7)
// CCDND<CCDND0>
extern volatile __bit                   CCDND0              __at(0x1D3C8);	// @ (0x3A79 * 8 + 0)
#define                                 CCDND0_bit          _BIT_ACCESS(CCDND,0)
// CCDND<CCDND1>
extern volatile __bit                   CCDND1              __at(0x1D3C9);	// @ (0x3A79 * 8 + 1)
#define                                 CCDND1_bit          _BIT_ACCESS(CCDND,1)
// CCDND<CCDND2>
extern volatile __bit                   CCDND2              __at(0x1D3CA);	// @ (0x3A79 * 8 + 2)
#define                                 CCDND2_bit          _BIT_ACCESS(CCDND,2)
// CCDND<CCDND3>
extern volatile __bit                   CCDND3              __at(0x1D3CB);	// @ (0x3A79 * 8 + 3)
#define                                 CCDND3_bit          _BIT_ACCESS(CCDND,3)
// CCDND<CCDND4>
extern volatile __bit                   CCDND4              __at(0x1D3CC);	// @ (0x3A79 * 8 + 4)
#define                                 CCDND4_bit          _BIT_ACCESS(CCDND,4)
// CCDND<CCDND5>
extern volatile __bit                   CCDND5              __at(0x1D3CD);	// @ (0x3A79 * 8 + 5)
#define                                 CCDND5_bit          _BIT_ACCESS(CCDND,5)
// CCDND<CCDND6>
extern volatile __bit                   CCDND6              __at(0x1D3CE);	// @ (0x3A79 * 8 + 6)
#define                                 CCDND6_bit          _BIT_ACCESS(CCDND,6)
// CCDND<CCDND7>
extern volatile __bit                   CCDND7              __at(0x1D3CF);	// @ (0x3A79 * 8 + 7)
#define                                 CCDND7_bit          _BIT_ACCESS(CCDND,7)
// CCDNE<CCDNE0>
extern volatile __bit                   CCDNE0              __at(0x1D448);	// @ (0x3A89 * 8 + 0)
#define                                 CCDNE0_bit          _BIT_ACCESS(CCDNE,0)
// CCDNE<CCDNE1>
extern volatile __bit                   CCDNE1              __at(0x1D449);	// @ (0x3A89 * 8 + 1)
#define                                 CCDNE1_bit          _BIT_ACCESS(CCDNE,1)
// CCDNE<CCDNE2>
extern volatile __bit                   CCDNE2              __at(0x1D44A);	// @ (0x3A89 * 8 + 2)
#define                                 CCDNE2_bit          _BIT_ACCESS(CCDNE,2)
// CCDPA<CCDPA0>
extern volatile __bit                   CCDPA0              __at(0x1D240);	// @ (0x3A48 * 8 + 0)
#define                                 CCDPA0_bit          _BIT_ACCESS(CCDPA,0)
// CCDPA<CCDPA1>
extern volatile __bit                   CCDPA1              __at(0x1D241);	// @ (0x3A48 * 8 + 1)
#define                                 CCDPA1_bit          _BIT_ACCESS(CCDPA,1)
// CCDPA<CCDPA2>
extern volatile __bit                   CCDPA2              __at(0x1D242);	// @ (0x3A48 * 8 + 2)
#define                                 CCDPA2_bit          _BIT_ACCESS(CCDPA,2)
// CCDPA<CCDPA3>
extern volatile __bit                   CCDPA3              __at(0x1D243);	// @ (0x3A48 * 8 + 3)
#define                                 CCDPA3_bit          _BIT_ACCESS(CCDPA,3)
// CCDPA<CCDPA4>
extern volatile __bit                   CCDPA4              __at(0x1D244);	// @ (0x3A48 * 8 + 4)
#define                                 CCDPA4_bit          _BIT_ACCESS(CCDPA,4)
// CCDPA<CCDPA5>
extern volatile __bit                   CCDPA5              __at(0x1D245);	// @ (0x3A48 * 8 + 5)
#define                                 CCDPA5_bit          _BIT_ACCESS(CCDPA,5)
// CCDPA<CCDPA6>
extern volatile __bit                   CCDPA6              __at(0x1D246);	// @ (0x3A48 * 8 + 6)
#define                                 CCDPA6_bit          _BIT_ACCESS(CCDPA,6)
// CCDPA<CCDPA7>
extern volatile __bit                   CCDPA7              __at(0x1D247);	// @ (0x3A48 * 8 + 7)
#define                                 CCDPA7_bit          _BIT_ACCESS(CCDPA,7)
// CCDPB<CCDPB0>
extern volatile __bit                   CCDPB0              __at(0x1D2C0);	// @ (0x3A58 * 8 + 0)
#define                                 CCDPB0_bit          _BIT_ACCESS(CCDPB,0)
// CCDPB<CCDPB1>
extern volatile __bit                   CCDPB1              __at(0x1D2C1);	// @ (0x3A58 * 8 + 1)
#define                                 CCDPB1_bit          _BIT_ACCESS(CCDPB,1)
// CCDPB<CCDPB2>
extern volatile __bit                   CCDPB2              __at(0x1D2C2);	// @ (0x3A58 * 8 + 2)
#define                                 CCDPB2_bit          _BIT_ACCESS(CCDPB,2)
// CCDPB<CCDPB3>
extern volatile __bit                   CCDPB3              __at(0x1D2C3);	// @ (0x3A58 * 8 + 3)
#define                                 CCDPB3_bit          _BIT_ACCESS(CCDPB,3)
// CCDPB<CCDPB4>
extern volatile __bit                   CCDPB4              __at(0x1D2C4);	// @ (0x3A58 * 8 + 4)
#define                                 CCDPB4_bit          _BIT_ACCESS(CCDPB,4)
// CCDPB<CCDPB5>
extern volatile __bit                   CCDPB5              __at(0x1D2C5);	// @ (0x3A58 * 8 + 5)
#define                                 CCDPB5_bit          _BIT_ACCESS(CCDPB,5)
// CCDPB<CCDPB6>
extern volatile __bit                   CCDPB6              __at(0x1D2C6);	// @ (0x3A58 * 8 + 6)
#define                                 CCDPB6_bit          _BIT_ACCESS(CCDPB,6)
// CCDPB<CCDPB7>
extern volatile __bit                   CCDPB7              __at(0x1D2C7);	// @ (0x3A58 * 8 + 7)
#define                                 CCDPB7_bit          _BIT_ACCESS(CCDPB,7)
// CCDPC<CCDPC0>
extern volatile __bit                   CCDPC0              __at(0x1D340);	// @ (0x3A68 * 8 + 0)
#define                                 CCDPC0_bit          _BIT_ACCESS(CCDPC,0)
// CCDPC<CCDPC1>
extern volatile __bit                   CCDPC1              __at(0x1D341);	// @ (0x3A68 * 8 + 1)
#define                                 CCDPC1_bit          _BIT_ACCESS(CCDPC,1)
// CCDPC<CCDPC2>
extern volatile __bit                   CCDPC2              __at(0x1D342);	// @ (0x3A68 * 8 + 2)
#define                                 CCDPC2_bit          _BIT_ACCESS(CCDPC,2)
// CCDPC<CCDPC3>
extern volatile __bit                   CCDPC3              __at(0x1D343);	// @ (0x3A68 * 8 + 3)
#define                                 CCDPC3_bit          _BIT_ACCESS(CCDPC,3)
// CCDPC<CCDPC4>
extern volatile __bit                   CCDPC4              __at(0x1D344);	// @ (0x3A68 * 8 + 4)
#define                                 CCDPC4_bit          _BIT_ACCESS(CCDPC,4)
// CCDPC<CCDPC5>
extern volatile __bit                   CCDPC5              __at(0x1D345);	// @ (0x3A68 * 8 + 5)
#define                                 CCDPC5_bit          _BIT_ACCESS(CCDPC,5)
// CCDPC<CCDPC6>
extern volatile __bit                   CCDPC6              __at(0x1D346);	// @ (0x3A68 * 8 + 6)
#define                                 CCDPC6_bit          _BIT_ACCESS(CCDPC,6)
// CCDPC<CCDPC7>
extern volatile __bit                   CCDPC7              __at(0x1D347);	// @ (0x3A68 * 8 + 7)
#define                                 CCDPC7_bit          _BIT_ACCESS(CCDPC,7)
// CCDPD<CCDPD0>
extern volatile __bit                   CCDPD0              __at(0x1D3C0);	// @ (0x3A78 * 8 + 0)
#define                                 CCDPD0_bit          _BIT_ACCESS(CCDPD,0)
// CCDPD<CCDPD1>
extern volatile __bit                   CCDPD1              __at(0x1D3C1);	// @ (0x3A78 * 8 + 1)
#define                                 CCDPD1_bit          _BIT_ACCESS(CCDPD,1)
// CCDPD<CCDPD2>
extern volatile __bit                   CCDPD2              __at(0x1D3C2);	// @ (0x3A78 * 8 + 2)
#define                                 CCDPD2_bit          _BIT_ACCESS(CCDPD,2)
// CCDPD<CCDPD3>
extern volatile __bit                   CCDPD3              __at(0x1D3C3);	// @ (0x3A78 * 8 + 3)
#define                                 CCDPD3_bit          _BIT_ACCESS(CCDPD,3)
// CCDPD<CCDPD4>
extern volatile __bit                   CCDPD4              __at(0x1D3C4);	// @ (0x3A78 * 8 + 4)
#define                                 CCDPD4_bit          _BIT_ACCESS(CCDPD,4)
// CCDPD<CCDPD5>
extern volatile __bit                   CCDPD5              __at(0x1D3C5);	// @ (0x3A78 * 8 + 5)
#define                                 CCDPD5_bit          _BIT_ACCESS(CCDPD,5)
// CCDPD<CCDPD6>
extern volatile __bit                   CCDPD6              __at(0x1D3C6);	// @ (0x3A78 * 8 + 6)
#define                                 CCDPD6_bit          _BIT_ACCESS(CCDPD,6)
// CCDPD<CCDPD7>
extern volatile __bit                   CCDPD7              __at(0x1D3C7);	// @ (0x3A78 * 8 + 7)
#define                                 CCDPD7_bit          _BIT_ACCESS(CCDPD,7)
// CCDPE<CCDPE0>
extern volatile __bit                   CCDPE0              __at(0x1D440);	// @ (0x3A88 * 8 + 0)
#define                                 CCDPE0_bit          _BIT_ACCESS(CCDPE,0)
// CCDPE<CCDPE1>
extern volatile __bit                   CCDPE1              __at(0x1D441);	// @ (0x3A88 * 8 + 1)
#define                                 CCDPE1_bit          _BIT_ACCESS(CCDPE,1)
// CCDPE<CCDPE2>
extern volatile __bit                   CCDPE2              __at(0x1D442);	// @ (0x3A88 * 8 + 2)
#define                                 CCDPE2_bit          _BIT_ACCESS(CCDPE,2)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1FBF8);	// @ (0x3F7F * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1FBF9);	// @ (0x3F7F * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x1FBFA);	// @ (0x3F7F * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1FBF7);	// @ (0x3F7E * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1FBF4);	// @ (0x3F7E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE4<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x1CCA3);	// @ (0x3994 * 8 + 3)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x1CD23);	// @ (0x39A4 * 8 + 3)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR4,3)
// IPR4<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x1CC23);	// @ (0x3984 * 8 + 3)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR4,3)
// PMD3<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x1CE18);	// @ (0x39C3 * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD3,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1FBF0);	// @ (0x3F7E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1FBF1);	// @ (0x3F7E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1FBF2);	// @ (0x3F7E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1FBF3);	// @ (0x3F7E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1FBF5);	// @ (0x3F7E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1FBD8);	// @ (0x3F7B * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1FBD9);	// @ (0x3F7B * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x1FBDA);	// @ (0x3F7B * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1FBD7);	// @ (0x3F7A * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1FBD4);	// @ (0x3F7A * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE7<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x1CCB9);	// @ (0x3997 * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE7,1)
// PIR7<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x1CD39);	// @ (0x39A7 * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR7,1)
// IPR7<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x1CC39);	// @ (0x3987 * 8 + 1)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR7,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x1CE19);	// @ (0x39C3 * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1FBD0);	// @ (0x3F7A * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1FBD1);	// @ (0x3F7A * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1FBD2);	// @ (0x3F7A * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1FBD3);	// @ (0x3F7A * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1FBD5);	// @ (0x3F7A * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x1FBB8);	// @ (0x3F77 * 8 + 0)
#define                                 CCP3CTS0_bit        _BIT_ACCESS(CCP3CAP,0)
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x1FBB9);	// @ (0x3F77 * 8 + 1)
#define                                 CCP3CTS1_bit        _BIT_ACCESS(CCP3CAP,1)
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x1FBBA);	// @ (0x3F77 * 8 + 2)
#define                                 CCP3CTS2_bit        _BIT_ACCESS(CCP3CAP,2)
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x1FBB7);	// @ (0x3F76 * 8 + 7)
#define                                 CCP3EN_bit          _BIT_ACCESS(CCP3CON,7)
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x1FBB4);	// @ (0x3F76 * 8 + 4)
#define                                 CCP3FMT_bit         _BIT_ACCESS(CCP3CON,4)
// PIE9<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x1CCC9);	// @ (0x3999 * 8 + 1)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE9,1)
// PIR9<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x1CD49);	// @ (0x39A9 * 8 + 1)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR9,1)
// IPR9<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x1CC49);	// @ (0x3989 * 8 + 1)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR9,1)
// PMD3<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x1CE1A);	// @ (0x39C3 * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD3,2)
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x1FBB0);	// @ (0x3F76 * 8 + 0)
#define                                 CCP3MODE0_bit       _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x1FBB1);	// @ (0x3F76 * 8 + 1)
#define                                 CCP3MODE1_bit       _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x1FBB2);	// @ (0x3F76 * 8 + 2)
#define                                 CCP3MODE2_bit       _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x1FBB3);	// @ (0x3F76 * 8 + 3)
#define                                 CCP3MODE3_bit       _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x1FBB5);	// @ (0x3F76 * 8 + 5)
#define                                 CCP3OUT_bit         _BIT_ACCESS(CCP3CON,5)
// CCP4CAP<CCP4CTS0>
extern volatile __bit                   CCP4CTS0            __at(0x1FB98);	// @ (0x3F73 * 8 + 0)
#define                                 CCP4CTS0_bit        _BIT_ACCESS(CCP4CAP,0)
// CCP4CAP<CCP4CTS1>
extern volatile __bit                   CCP4CTS1            __at(0x1FB99);	// @ (0x3F73 * 8 + 1)
#define                                 CCP4CTS1_bit        _BIT_ACCESS(CCP4CAP,1)
// CCP4CAP<CCP4CTS2>
extern volatile __bit                   CCP4CTS2            __at(0x1FB9A);	// @ (0x3F73 * 8 + 2)
#define                                 CCP4CTS2_bit        _BIT_ACCESS(CCP4CAP,2)
// CCP4CON<CCP4EN>
extern volatile __bit                   CCP4EN              __at(0x1FB97);	// @ (0x3F72 * 8 + 7)
#define                                 CCP4EN_bit          _BIT_ACCESS(CCP4CON,7)
// CCP4CON<CCP4FMT>
extern volatile __bit                   CCP4FMT             __at(0x1FB94);	// @ (0x3F72 * 8 + 4)
#define                                 CCP4FMT_bit         _BIT_ACCESS(CCP4CON,4)
// PIE10<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x1CCD0);	// @ (0x399A * 8 + 0)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE10,0)
// PIR10<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x1CD50);	// @ (0x39AA * 8 + 0)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR10,0)
// IPR10<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x1CC50);	// @ (0x398A * 8 + 0)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR10,0)
// PMD3<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x1CE1B);	// @ (0x39C3 * 8 + 3)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD3,3)
// CCP4CON<CCP4MODE0>
extern volatile __bit                   CCP4MODE0           __at(0x1FB90);	// @ (0x3F72 * 8 + 0)
#define                                 CCP4MODE0_bit       _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4MODE1>
extern volatile __bit                   CCP4MODE1           __at(0x1FB91);	// @ (0x3F72 * 8 + 1)
#define                                 CCP4MODE1_bit       _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4MODE2>
extern volatile __bit                   CCP4MODE2           __at(0x1FB92);	// @ (0x3F72 * 8 + 2)
#define                                 CCP4MODE2_bit       _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4MODE3>
extern volatile __bit                   CCP4MODE3           __at(0x1FB93);	// @ (0x3F72 * 8 + 3)
#define                                 CCP4MODE3_bit       _BIT_ACCESS(CCP4CON,3)
// CCP4CON<CCP4OUT>
extern volatile __bit                   CCP4OUT             __at(0x1FB95);	// @ (0x3F72 * 8 + 5)
#define                                 CCP4OUT_bit         _BIT_ACCESS(CCP4CON,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1F60A);	// @ (0x3EC1 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1F60B);	// @ (0x3EC1 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x1CED0);	// @ (0x39DA * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x1CED1);	// @ (0x39DA * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x1CED2);	// @ (0x39DA * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x1CED3);	// @ (0x39DA * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MD1CARH<CH0>
