MikroElektronika/core_packages/PIC/XC8/def/PIC18F46K42/mcu.h
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x1CBD0);	// @ (0x397A * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x1CBD1);	// @ (0x397A * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// OSCFRQ<HFFRQ0>
extern volatile __bit                   HFFRQ0              __at(0x1CEF8);	// @ (0x39DF * 8 + 0)
#define                                 HFFRQ0_bit          _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<HFFRQ1>
extern volatile __bit                   HFFRQ1              __at(0x1CEF9);	// @ (0x39DF * 8 + 1)
#define                                 HFFRQ1_bit          _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<HFFRQ2>
extern volatile __bit                   HFFRQ2              __at(0x1CEFA);	// @ (0x39DF * 8 + 2)
#define                                 HFFRQ2_bit          _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<HFFRQ3>
extern volatile __bit                   HFFRQ3              __at(0x1CEFB);	// @ (0x39DF * 8 + 3)
#define                                 HFFRQ3_bit          _BIT_ACCESS(OSCFRQ,3)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x1CEEE);	// @ (0x39DD * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x1CEE6);	// @ (0x39DC * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// OSCTUNE<HFTUN0>
extern volatile __bit                   HFTUN0              __at(0x1CEF0);	// @ (0x39DE * 8 + 0)
#define                                 HFTUN0_bit          _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<HFTUN1>
extern volatile __bit                   HFTUN1              __at(0x1CEF1);	// @ (0x39DE * 8 + 1)
#define                                 HFTUN1_bit          _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<HFTUN2>
extern volatile __bit                   HFTUN2              __at(0x1CEF2);	// @ (0x39DE * 8 + 2)
#define                                 HFTUN2_bit          _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<HFTUN3>
extern volatile __bit                   HFTUN3              __at(0x1CEF3);	// @ (0x39DE * 8 + 3)
#define                                 HFTUN3_bit          _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<HFTUN4>
extern volatile __bit                   HFTUN4              __at(0x1CEF4);	// @ (0x39DE * 8 + 4)
#define                                 HFTUN4_bit          _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<HFTUN5>
extern volatile __bit                   HFTUN5              __at(0x1CEF5);	// @ (0x39DE * 8 + 5)
#define                                 HFTUN5_bit          _BIT_ACCESS(OSCTUNE,5)
// HLVDCON0<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x1F64F);	// @ (0x3EC9 * 8 + 7)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON0,7)
// PIE0<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x1CC81);	// @ (0x3990 * 8 + 1)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x1CD01);	// @ (0x39A0 * 8 + 1)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR0,1)
// HLVDCON0<HLVDINTH>
extern volatile __bit                   HLVDINTH            __at(0x1F649);	// @ (0x3EC9 * 8 + 1)
#define                                 HLVDINTH_bit        _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<HLVDINTL>
extern volatile __bit                   HLVDINTL            __at(0x1F648);	// @ (0x3EC9 * 8 + 0)
#define                                 HLVDINTL_bit        _BIT_ACCESS(HLVDCON0,0)
// IPR0<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x1CC01);	// @ (0x3980 * 8 + 1)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR0,1)
// PMD0<HLVDMD>
extern volatile __bit                   HLVDMD              __at(0x1CE05);	// @ (0x39C0 * 8 + 5)
#define                                 HLVDMD_bit          _BIT_ACCESS(PMD0,5)
// HLVDCON0<HLVDOUT>
extern volatile __bit                   HLVDOUT             __at(0x1F64D);	// @ (0x3EC9 * 8 + 5)
#define                                 HLVDOUT_bit         _BIT_ACCESS(HLVDCON0,5)
// HLVDCON0<HLVDRDY>
extern volatile __bit                   HLVDRDY             __at(0x1F64C);	// @ (0x3EC9 * 8 + 4)
#define                                 HLVDRDY_bit         _BIT_ACCESS(HLVDCON0,4)
// HLVDCON1<HLVDSEL0>
extern volatile __bit                   HLVDSEL0            __at(0x1F650);	// @ (0x3ECA * 8 + 0)
#define                                 HLVDSEL0_bit        _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<HLVDSEL1>
extern volatile __bit                   HLVDSEL1            __at(0x1F651);	// @ (0x3ECA * 8 + 1)
#define                                 HLVDSEL1_bit        _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<HLVDSEL2>
extern volatile __bit                   HLVDSEL2            __at(0x1F652);	// @ (0x3ECA * 8 + 2)
#define                                 HLVDSEL2_bit        _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<HLVDSEL3>
extern volatile __bit                   HLVDSEL3            __at(0x1F653);	// @ (0x3ECA * 8 + 3)
#define                                 HLVDSEL3_bit        _BIT_ACCESS(HLVDCON1,3)
// PIE3<I2C1EIE>
extern volatile __bit                   I2C1EIE             __at(0x1CC9A);	// @ (0x3993 * 8 + 2)
#define                                 I2C1EIE_bit         _BIT_ACCESS(PIE3,2)
// PIR3<I2C1EIF>
extern volatile __bit                   I2C1EIF             __at(0x1CD1A);	// @ (0x39A3 * 8 + 2)
#define                                 I2C1EIF_bit         _BIT_ACCESS(PIR3,2)
// IPR3<I2C1EIP>
extern volatile __bit                   I2C1EIP             __at(0x1CC1A);	// @ (0x3983 * 8 + 2)
#define                                 I2C1EIP_bit         _BIT_ACCESS(IPR3,2)
// PIE3<I2C1IE>
extern volatile __bit                   I2C1IE              __at(0x1CC99);	// @ (0x3993 * 8 + 1)
#define                                 I2C1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<I2C1IF>
extern volatile __bit                   I2C1IF              __at(0x1CD19);	// @ (0x39A3 * 8 + 1)
#define                                 I2C1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<I2C1IP>
extern volatile __bit                   I2C1IP              __at(0x1CC19);	// @ (0x3983 * 8 + 1)
#define                                 I2C1IP_bit          _BIT_ACCESS(IPR3,1)
// PMD5<I2C1MD>
extern volatile __bit                   I2C1MD              __at(0x1CE28);	// @ (0x39C5 * 8 + 0)
#define                                 I2C1MD_bit          _BIT_ACCESS(PMD5,0)
// PIE2<I2C1RXIE>
extern volatile __bit                   I2C1RXIE            __at(0x1CC97);	// @ (0x3992 * 8 + 7)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE2,7)
// PIR2<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x1CD17);	// @ (0x39A2 * 8 + 7)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR2,7)
// IPR2<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x1CC17);	// @ (0x3982 * 8 + 7)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR2,7)
// PIE3<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x1CC98);	// @ (0x3993 * 8 + 0)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x1CD18);	// @ (0x39A3 * 8 + 0)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x1CC18);	// @ (0x3983 * 8 + 0)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR3,0)
// PIE6<I2C2EIE>
extern volatile __bit                   I2C2EIE             __at(0x1CCB1);	// @ (0x3996 * 8 + 1)
#define                                 I2C2EIE_bit         _BIT_ACCESS(PIE6,1)
// PIR6<I2C2EIF>
extern volatile __bit                   I2C2EIF             __at(0x1CD31);	// @ (0x39A6 * 8 + 1)
#define                                 I2C2EIF_bit         _BIT_ACCESS(PIR6,1)
// IPR6<I2C2EIP>
extern volatile __bit                   I2C2EIP             __at(0x1CC31);	// @ (0x3986 * 8 + 1)
#define                                 I2C2EIP_bit         _BIT_ACCESS(IPR6,1)
// PIE6<I2C2IE>
extern volatile __bit                   I2C2IE              __at(0x1CCB0);	// @ (0x3996 * 8 + 0)
#define                                 I2C2IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<I2C2IF>
extern volatile __bit                   I2C2IF              __at(0x1CD30);	// @ (0x39A6 * 8 + 0)
#define                                 I2C2IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<I2C2IP>
extern volatile __bit                   I2C2IP              __at(0x1CC30);	// @ (0x3986 * 8 + 0)
#define                                 I2C2IP_bit          _BIT_ACCESS(IPR6,0)
// PMD5<I2C2MD>
extern volatile __bit                   I2C2MD              __at(0x1CE29);	// @ (0x39C5 * 8 + 1)
#define                                 I2C2MD_bit          _BIT_ACCESS(PMD5,1)
// PIE5<I2C2RXIE>
extern volatile __bit                   I2C2RXIE            __at(0x1CCAE);	// @ (0x3995 * 8 + 6)
#define                                 I2C2RXIE_bit        _BIT_ACCESS(PIE5,6)
// PIR5<I2C2RXIF>
extern volatile __bit                   I2C2RXIF            __at(0x1CD2E);	// @ (0x39A5 * 8 + 6)
#define                                 I2C2RXIF_bit        _BIT_ACCESS(PIR5,6)
// IPR5<I2C2RXIP>
extern volatile __bit                   I2C2RXIP            __at(0x1CC2E);	// @ (0x3985 * 8 + 6)
#define                                 I2C2RXIP_bit        _BIT_ACCESS(IPR5,6)
// PIE5<I2C2TXIE>
extern volatile __bit                   I2C2TXIE            __at(0x1CCAF);	// @ (0x3995 * 8 + 7)
#define                                 I2C2TXIE_bit        _BIT_ACCESS(PIE5,7)
// PIR5<I2C2TXIF>
extern volatile __bit                   I2C2TXIF            __at(0x1CD2F);	// @ (0x39A5 * 8 + 7)
#define                                 I2C2TXIF_bit        _BIT_ACCESS(PIR5,7)
// IPR5<I2C2TXIP>
extern volatile __bit                   I2C2TXIP            __at(0x1CC2F);	// @ (0x3985 * 8 + 7)
#define                                 I2C2TXIP_bit        _BIT_ACCESS(IPR5,7)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x1CEC7);	// @ (0x39D8 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x1F9D8);	// @ (0x3F3B * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x1F9D9);	// @ (0x3F3B * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x1F9E2);	// @ (0x3F3C * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x1F9E3);	// @ (0x3F3C * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x1F9E4);	// @ (0x3F3C * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x1F9E5);	// @ (0x3F3C * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x1F9E6);	// @ (0x3F3C * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x1F9E7);	// @ (0x3F3C * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x1F9E8);	// @ (0x3F3D * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x1F9E9);	// @ (0x3F3D * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x1F9EA);	// @ (0x3F3D * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x1F9EB);	// @ (0x3F3D * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x1F9DA);	// @ (0x3F3B * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x1F9DB);	// @ (0x3F3B * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x1F9DC);	// @ (0x3F3B * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x1F9DD);	// @ (0x3F3B * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x1F9DE);	// @ (0x3F3B * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x1F9DF);	// @ (0x3F3B * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x1F9E0);	// @ (0x3F3C * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x1F9E1);	// @ (0x3F3C * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1D220);	// @ (0x3A44 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1D221);	// @ (0x3A44 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1D222);	// @ (0x3A44 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1D223);	// @ (0x3A44 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1D224);	// @ (0x3A44 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1D225);	// @ (0x3A44 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x1D226);	// @ (0x3A44 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x1D227);	// @ (0x3A44 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x1D2A0);	// @ (0x3A54 * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x1D2A1);	// @ (0x3A54 * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x1D2A2);	// @ (0x3A54 * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x1D2A3);	// @ (0x3A54 * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x1D2A4);	// @ (0x3A54 * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x1D2A5);	// @ (0x3A54 * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x1D2A6);	// @ (0x3A54 * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x1D2A7);	// @ (0x3A54 * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1D320);	// @ (0x3A64 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1D321);	// @ (0x3A64 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1D322);	// @ (0x3A64 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1D323);	// @ (0x3A64 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1D324);	// @ (0x3A64 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1D325);	// @ (0x3A64 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x1D326);	// @ (0x3A64 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x1D327);	// @ (0x3A64 * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLD<INLVLD0>
extern volatile __bit                   INLVLD0             __at(0x1D3A0);	// @ (0x3A74 * 8 + 0)
#define                                 INLVLD0_bit         _BIT_ACCESS(INLVLD,0)
// INLVLD<INLVLD1>
extern volatile __bit                   INLVLD1             __at(0x1D3A1);	// @ (0x3A74 * 8 + 1)
#define                                 INLVLD1_bit         _BIT_ACCESS(INLVLD,1)
// INLVLD<INLVLD2>
extern volatile __bit                   INLVLD2             __at(0x1D3A2);	// @ (0x3A74 * 8 + 2)
#define                                 INLVLD2_bit         _BIT_ACCESS(INLVLD,2)
// INLVLD<INLVLD3>
extern volatile __bit                   INLVLD3             __at(0x1D3A3);	// @ (0x3A74 * 8 + 3)
#define                                 INLVLD3_bit         _BIT_ACCESS(INLVLD,3)
// INLVLD<INLVLD4>
extern volatile __bit                   INLVLD4             __at(0x1D3A4);	// @ (0x3A74 * 8 + 4)
#define                                 INLVLD4_bit         _BIT_ACCESS(INLVLD,4)
// INLVLD<INLVLD5>
extern volatile __bit                   INLVLD5             __at(0x1D3A5);	// @ (0x3A74 * 8 + 5)
#define                                 INLVLD5_bit         _BIT_ACCESS(INLVLD,5)
// INLVLD<INLVLD6>
extern volatile __bit                   INLVLD6             __at(0x1D3A6);	// @ (0x3A74 * 8 + 6)
#define                                 INLVLD6_bit         _BIT_ACCESS(INLVLD,6)
// INLVLD<INLVLD7>
extern volatile __bit                   INLVLD7             __at(0x1D3A7);	// @ (0x3A74 * 8 + 7)
#define                                 INLVLD7_bit         _BIT_ACCESS(INLVLD,7)
// INLVLE<INLVLE0>
extern volatile __bit                   INLVLE0             __at(0x1D420);	// @ (0x3A84 * 8 + 0)
#define                                 INLVLE0_bit         _BIT_ACCESS(INLVLE,0)
// INLVLE<INLVLE1>
extern volatile __bit                   INLVLE1             __at(0x1D421);	// @ (0x3A84 * 8 + 1)
#define                                 INLVLE1_bit         _BIT_ACCESS(INLVLE,1)
// INLVLE<INLVLE2>
extern volatile __bit                   INLVLE2             __at(0x1D422);	// @ (0x3A84 * 8 + 2)
#define                                 INLVLE2_bit         _BIT_ACCESS(INLVLE,2)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x1D423);	// @ (0x3A84 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INTCON0<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x1FE90);	// @ (0x3FD2 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON0,0)
// PIE1<INT0IE>
extern volatile __bit                   INT0IE              __at(0x1CC88);	// @ (0x3991 * 8 + 0)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<INT0IF>
extern volatile __bit                   INT0IF              __at(0x1CD08);	// @ (0x39A1 * 8 + 0)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR1,0)
// IPR1<INT0IP>
extern volatile __bit                   INT0IP              __at(0x1CC08);	// @ (0x3981 * 8 + 0)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR1,0)
// INTCON0<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x1FE91);	// @ (0x3FD2 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON0,1)
// PIE5<INT1IE>
extern volatile __bit                   INT1IE              __at(0x1CCA8);	// @ (0x3995 * 8 + 0)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE5,0)
// PIR5<INT1IF>
extern volatile __bit                   INT1IF              __at(0x1CD28);	// @ (0x39A5 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR5,0)
// IPR5<INT1IP>
extern volatile __bit                   INT1IP              __at(0x1CC28);	// @ (0x3985 * 8 + 0)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR5,0)
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x1FE92);	// @ (0x3FD2 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON0,2)
// PIE7<INT2IE>
extern volatile __bit                   INT2IE              __at(0x1CCBD);	// @ (0x3997 * 8 + 5)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE7,5)
// PIR7<INT2IF>
extern volatile __bit                   INT2IF              __at(0x1CD3D);	// @ (0x39A7 * 8 + 5)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR7,5)
// IPR7<INT2IP>
